Revit 2026 API

# ElectricalSystemOtherConductorSize Property

---

The size of an Other Conductor in the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId OtherConductorSize { get; }
```
```vb
Public ReadOnly Property OtherConductorSize As ElementId
	Get
```
```cpp
public:
property ElementId^ OtherConductorSize {
	ElementId^ get ();
}
```
```fsharp
member OtherConductorSize : ElementId with get
```

#### Property Value

ElementId

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This property only available when System Type is Power! |

Each Other Conductor has the same size in the Electrical System.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace